### Terraform Plan - `dev` Environment

<details>
<summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01NjQwMDBmNi05NDQ3LTQ2OTktYjg3ZS1iZWIzZDA1MjliYzQ7b2JqZWN0SWQ9MTg3ZjEwMTgtZWVhNi00YWU4LWJiMWItOGNjN2ZlYzFkNWM5O3N1YnNjcmlwdGlvbklkPWRjMjJkNmQ4LTA0OTUtNDY1My1hNjliLWVkZmUxNjg0MGY4ZTt0ZW5hbnRJZD02MWE4NzQ2ZS00MjRkLTQxMDUtYTA1NC1iMzg1NzNkNmU1NGE=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.chatops will be created
  + resource "azurerm_application_insights" "chatops" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "chatops-appinsights"
      + resource_group_name                   = "rg-chatops-dev"
      + retention_in_days                     = 90
      + sampling_percentage                   = 90
      + tags                                  = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + workspace_id                          = (known after apply)
    }

  # azurerm_key_vault.chatops will be created
  + resource "azurerm_key_vault" "chatops" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-chatops-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + tenant_id                     = "61a8746e-424d-4105-a054-b38573d6e54a"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_log_analytics_workspace.chatops will be created
  + resource "azurerm_log_analytics_workspace" "chatops" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "chatops-loganalytics"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-chatops-dev"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_action_group.ops_alerts will be created
  + resource "azurerm_monitor_action_group" "ops_alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "ops-alerts"
      + resource_group_name = "rg-chatops-dev"
      + short_name          = "OpsAlert"
      + tags                = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }

      + email_receiver {
          + email_address = "ops-team@company.com"
          + name          = "Operations Team"
        }
    }

  # azurerm_monitor_action_group.security_alerts will be created
  + resource "azurerm_monitor_action_group" "security_alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "security-alerts"
      + resource_group_name = "rg-chatops-dev"
      + short_name          = "SecAlerts"
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }

      + email_receiver {
          + email_address           = "security-team@company.com"
          + name                    = "security-team"
          + use_common_alert_schema = true
        }
    }

  # azurerm_monitor_diagnostic_setting.kv_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "kv-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.failed_dependency will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "failed_dependency" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when more than 5 dependency calls fail within 15 minutes, indicating downstream service issues."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "failed-dependency"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                dependencies
                | where timestamp > ago(15m)
                | where success == false
                | summarize Count = count()
            EOT
          + threshold               = 5
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "high_exception_rate" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when the exception rate exceeds 10 exceptions in 5 minutes, indicating potential application issues requiring investigation."
      + enabled                                = true
      + evaluation_frequency                   = "PT1M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "high-exception-rate"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                exceptions
                | where timestamp > ago(5m)
                | summarize Count = count()
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.kv_failed_auth will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "kv_failed_auth" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when Key Vault authentication failures exceed threshold, indicating potential brute-force or credential stuffing attacks."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "kv-failed-authentication-alert"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where ResourceType == "VAULTS"
                | where ResultSignature == "Unauthorized" or ResultSignature == "Forbidden" or httpStatusCode_d >= 400
                | summarize FailedAttempts = count() by bin(TimeGenerated, 15m)
            EOT
          + threshold               = 5
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_access_anomaly will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "kv_secret_access_anomaly" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when secret access from a single IP exceeds threshold, indicating potential data exfiltration or compromised credentials."
      + enabled                                = true
      + evaluation_frequency                   = "PT1H"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "kv-secret-access-anomaly-alert"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 1
      + tags                                   = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + window_duration                        = "PT1H"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where ResourceType == "VAULTS"
                | where OperationName in ("SecretGet", "SecretList")
                | summarize AccessCount = count() by CallerIPAddress, bin(TimeGenerated, 1h)
            EOT
          + threshold               = 100
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_expiration will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "kv_secret_expiration" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when Key Vault audit logs indicate items are near expiry or have expired, triggering investigation for rotation."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "kv-secret-expiration-alert"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 3
      + tags                                   = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where ResourceType == "VAULTS"
                | where OperationName has_any ("NearExpiry", "Expired")
                | summarize ExpiringItems = count() by Resource, OperationName, bin(TimeGenerated, 1d)
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "slow_response_time" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when average request duration exceeds 5 seconds, indicating performance degradation."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "slow-response-time"
      + resource_group_name                    = "rg-chatops-dev"
      + scopes                                 = (known after apply)
      + severity                               = 3
      + tags                                   = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                requests
                | where timestamp > ago(5m)
                | summarize AvgDuration = avg(duration)
            EOT
          + threshold               = 5000
          + time_aggregation_method = "Average"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_network_security_group.app_nsg will be created
  + resource "azurerm_network_security_group" "app_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "app-nsg"
      + resource_group_name = "rg-chatops-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_network_security_group.gateway_nsg will be created
  + resource "azurerm_network_security_group" "gateway_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "gateway-nsg"
      + resource_group_name = "rg-chatops-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_network_security_rule.allow_gateway_inbound will be created
  + resource "azurerm_network_security_rule" "allow_gateway_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowGatewayInbound"
      + network_security_group_name = "app-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "10.0.2.0/24"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow_gateway_manager will be created
  + resource "azurerm_network_security_rule" "allow_gateway_manager" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "65200-65535"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowGatewayManager"
      + network_security_group_name = "gateway-nsg"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "GatewayManager"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow_https_inbound will be created
  + resource "azurerm_network_security_rule" "allow_https_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPSInbound"
      + network_security_group_name = "gateway-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "Internet"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow_internet_outbound will be created
  + resource "azurerm_network_security_rule" "allow_internet_outbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowInternetOutbound"
      + network_security_group_name = "app-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.deny_all_inbound will be created
  + resource "azurerm_network_security_rule" "deny_all_inbound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "app-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_watcher.chatops will be created
  + resource "azurerm_network_watcher" "chatops" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "chatops-network-watcher"
      + resource_group_name = "rg-chatops-dev"
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_network_watcher_flow_log.app_nsg_flow_log will be created
  + resource "azurerm_network_watcher_flow_log" "app_nsg_flow_log" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "app-nsg-flow-log"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "chatops-network-watcher"
      + resource_group_name       = "rg-chatops-dev"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 90
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "eastus"
          + workspace_resource_id = (known after apply)
        }
    }

  # azurerm_resource_group.chatops will be created
  + resource "azurerm_resource_group" "chatops" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-chatops-dev"
      + tags     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
    }

  # azurerm_storage_account.nsg_flow_logs will be created
  + resource "azurerm_storage_account" "nsg_flow_logs" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-chatops-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "NSG Flow Logs"
        }
    }

  # azurerm_subnet.app_subnet will be created
  + resource "azurerm_subnet" "app_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-chatops-dev"
      + virtual_network_name                           = "chatops-vnet"

      + delegation {
          + name = "app-service-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet.gateway_subnet will be created
  + resource "azurerm_subnet" "gateway_subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "gateway-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-chatops-dev"
      + virtual_network_name                           = "chatops-vnet"
    }

  # azurerm_subnet_network_security_group_association.app_nsg_assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "app_nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.gateway_nsg_assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "gateway_nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.chatops_vnet will be created
  + resource "azurerm_virtual_network" "chatops_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "chatops-vnet"
      + resource_group_name = "rg-chatops-dev"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
    }

  # random_string.kv_suffix will be created
  + resource "random_string" "kv_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.storage_suffix will be created
  + resource "random_string" "storage_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_nsg_id                                   = (known after apply)
  + app_nsg_name                                 = "app-nsg"
  + app_subnet_address_prefixes                  = [
      + "10.0.1.0/24",
    ]
  + app_subnet_id                                = (known after apply)
  + app_subnet_name                              = "app-subnet"
  + application_insights_app_id                  = (known after apply)
  + application_insights_connection_string       = (sensitive value)
  + application_insights_id                      = (known after apply)
  + application_insights_instrumentation_key     = (sensitive value)
  + gateway_nsg_id                               = (known after apply)
  + gateway_nsg_name                             = "gateway-nsg"
  + gateway_subnet_address_prefixes              = [
      + "10.0.2.0/24",
    ]
  + gateway_subnet_id                            = (known after apply)
  + gateway_subnet_name                          = "gateway-subnet"
  + key_vault_id                                 = (known after apply)
  + key_vault_name                               = (known after apply)
  + key_vault_uri                                = (known after apply)
  + kv_failed_auth_alert_id                      = (known after apply)
  + kv_secret_access_anomaly_alert_id            = (known after apply)
  + kv_secret_expiration_alert_id                = (known after apply)
  + log_analytics_workspace_customer_id          = (sensitive value)
  + log_analytics_workspace_id                   = (known after apply)
  + resource_group_name                          = "rg-chatops-dev"
  + security_alerts_action_group_id              = (known after apply)
  + vnet_address_space                           = [
      + "10.0.0.0/16",
    ]
  + vnet_id                                      = (known after apply)
  + vnet_name                                    = "chatops-vnet"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @deividfoggi, Action: `pull_request`, Workflow: `Infrastructure - PR Validation`*